Requests_control/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <comment>Email ответственного</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <comment>Должность ответственного</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылкаИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВДокументах</name>
    <comment>Представление ответственного в документах</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексНумерации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Клиенты</name>
    <attributes>
      <name>ИдентификаторКлиента</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КаталогПрограммы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Requests_control/src/Catalogs/Пользователи/Forms/ФормаЭлементаДляАдминистратора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменениеПароля = Ложь;
	Элементы.ИзменитьПароль.Видимость = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Недействителен.Доступность = Ложь;
	КонецЕсли;	
	
	Если Не Объект.Недействителен Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			Объект.ИдентификаторПользователяИБ);
			
		Если ПользовательИБ <> Неопределено Тогда
				
			Если ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
				ПолныеПрава = Истина;
			КонецЕсли;	
			
			Логин = ПользовательИБ.Имя;
			
			Если ПользовательИБ.ПарольУстановлен Тогда
				Элементы.Пароль.Видимость = Ложь;
				Элементы.ИзменитьПароль.Видимость = Истина;
			Иначе	
				Элементы.Пароль.Видимость = Истина;
				Элементы.ИзменитьПароль.Видимость = Ложь;
				ИзменениеПароля = Истина;
			КонецЕсли;	
				
		КонецЕсли;
		
	Иначе 
		
		Элементы.Логин.Доступность = Ложь;
		Элементы.Пароль.Доступность = Ложь;
		Элементы.ИзменитьПароль.Доступность = Ложь;
		Элементы.ПолныеПрава.Доступность = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("ЭтоНовый", ТекущийОбъект.ЭтоНовый());
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ТекущийОбъект.ИдентификаторПользователяИБ);
		
	Если ТекущийОбъект.Недействителен Тогда
		// Удаляем пользователя
		Если ПользовательИБ <> Неопределено Тогда
			ПользовательИБ.Удалить();
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПользовательИБ <> Неопределено Тогда
			
		// Обновление существующего пользователя
		ПользовательИБ.Имя = Логин;
		ПользовательИБ.ПолноеИмя = Логин;
		Если ИзменениеПароля Тогда
			ПользовательИБ.Пароль = Пароль; 
		КонецЕсли;	
		ПользовательИБ.Роли.Очистить();
		Если ПолныеПрава Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.АдминистраторСистемы);
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.Пользователь);
		Иначе
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.Пользователь);
		КонецЕсли;
		
		ПользовательИБ.Записать();
		
	Иначе
		
		// Создание нового пользователя
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.АутентификацияСтандартная = Истина;
		ПользовательИБ.Имя = Логин;
		ПользовательИБ.Пароль = Пароль;
		ПользовательИБ.ПолноеИмя = Логин; 
		ПользовательИБ.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение;
		Если ПолныеПрава Тогда
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.АдминистраторСистемы);
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.Пользователь);
		Иначе
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.Пользователь);
		КонецЕсли;
		
		ПользовательИБ.Записать();
		
		ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
		
		ОписаниеПользователяИБ = Новый Структура;
		ОписаниеПользователяИБ.Вставить("Действие", "Записать");
		ОписаниеПользователяИБ.Вставить("УникальныйИдентификатор", ПользовательИБ.УникальныйИдентификатор);
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.ЭтоНовый Тогда
		РаботаССообщениямиКлиент.ОбновитьИспользованиеСозданияСообщений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПароль(Команда)
	
	Элементы.Пароль.Видимость = Истина;
	Элементы.ИзменитьПароль.Видимость = Ложь;
	ТекущийЭлемент = Элементы.Пароль;
	ИзменениеПароля = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Логин = ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(Объект.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура НедействителенПриИзменении(Элемент)
	
	Если Объект.Недействителен Тогда
		Логин = "";
		Элементы.Логин.Доступность = Ложь;
		Элементы.Пароль.Доступность = Ложь;
		Элементы.ИзменитьПароль.Доступность = Ложь;
		Элементы.ПолныеПрава.Доступность = Ложь;
	Иначе	
		Элементы.Логин.Доступность = Истина;
		Элементы.Пароль.Доступность = Истина;
		Элементы.ИзменитьПароль.Доступность = Истина;
		Элементы.ПолныеПрава.Доступность = Истина;
		Логин = ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(Объект.Наименование);
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Объект.АдресЭлектроннойПочты)
		И Не РаботаСоСтроками.ЭтоАдресЭлектроннойПочты(Объект.АдресЭлектроннойПочты) Тогда
		
		ТекстОшибки = НСтр("ru = 'Укажите корректный адрес электронной почты'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,
				"Объект.АдресЭлектроннойПочты",, Отказ);
			
	КонецЕсли;
	
КонецПроцедуры
